axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2017-2019 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses
**********************************************************************/

#include "ESP32CommandStation.h"

#include <ESPAsyncDNSServer.h>
#include <AsyncJson.h>

// generated web content
#include "generated/index_html.h"
#include "generated/jquery_min_js.h"
#include "generated/jquery_mobile_js.h"
#include "generated/jquery_mobile_css.h"
#include "generated/jquery_simple_websocket.h"
#include "generated/jq_clock.h"
#include "generated/ajax_loader.h"

AsyncWebServer webServer(80);
AsyncDNSServer asyncDNS;
AsyncWebSocket webSocket("/ws");

enum HTTP_STATUS_CODES {
  STATUS_OK = 200,
  STATUS_NOT_MODIFIED = 304,
  STATUS_BAD_REQUEST = 400,
  STATUS_NOT_FOUND = 404,
  STATUS_NOT_ALLOWED = 405,
  STATUS_NOT_ACCEPTABLE = 406,
  STATUS_CONFLICT = 409,
  STATUS_PRECONDITION_FAILED = 412,
  STATUS_SERVER_ERROR = 500
};

Atomic webSocketAtomic;
std::vector<WebSocketClient *> webSocketClients;

void handleWsEvent(AsyncWebSocket * server,
                   AsyncWebSocketClient * client,
                   AwsEventType type,
                   void * arg,
                   uint8_t *data,
                   size_t len) {
  if (type == WS_EVT_CONNECT) {
    {
      AtomicHolder h(&webSocketAtomic);
      webSocketClients.push_back(new WebSocketClient(client->id(), ntohl(client->remoteIP())));
    }
    client->printf("<iDCC++ ESP32 Command Station: V-%s / %s %s>", VERSION, __DATE__, __TIME__);
    infoScreen->replaceLine(INFO_SCREEN_CLIENTS_LINE, 
                            "TCP Conn: %02d",
                            webSocketClients.size() + jmriClients.size());
  } else if (type == WS_EVT_DISCONNECT) {
    {
      AtomicHolder h(&webSocketAtomic);
      auto elem = std::find_if(webSocketClients.begin(), webSocketClients.end(),
        [client](WebSocketClient *clientNode) -> bool {
          return (clientNode->getID() == client->id());
        }
      );
      if(elem != webSocketClients.end()) {
        delete *elem;
        webSocketClients.erase(elem);
      }
    }
    infoScreen->replaceLine(INFO_SCREEN_CLIENTS_LINE,
                            "TCP Conn: %02d",
                            webSocketClients.size() + jmriClients.size());
  } else if (type == WS_EVT_DATA) {
    {
      AtomicHolder h(&webSocketAtomic);
      for (auto clientNode : webSocketClients) {
        if(clientNode->getID() == client->id()) {
          clientNode->feed(data, len);
        }
      }
    }
  }
}

void handleOTAUpload(AsyncWebServerRequest *, const String&, size_t, uint8_t *, size_t, bool);

ESP32CSWebServer::ESP32CSWebServer(MDNS *mdns) : mdns_(mdns) {
}

void ESP32CSWebServer::begin() {
#if WIFI_ENABLE_SOFT_AP
  tcpip_adapter_ip_info_t ip_info;
  tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_AP, &ip_info);
  // store the IP address for use in the 404 handler
  softAPAddress_ = StringPrintf(IPSTR, IP2STR(&ip_info.ip));

  // start the async dns on the softap address
  asyncDNS.start(53, "*", ip_info.ip);
#endif
  webServer.on("/jquery.min.js", HTTP_GET,
               std::bind(&ESP32CSWebServer::streamResource, this, std::placeholders::_1));
  webServer.on("/jquery.mobile-1.5.0-rc1.min.js", HTTP_GET,
               std::bind(&ESP32CSWebServer::streamResource, this, std::placeholders::_1));
  webServer.on("/jquery.mobile-1.5.0-rc1.min.css", HTTP_GET,
               std::bind(&ESP32CSWebServer::streamResource, this, std::placeholders::_1));
  webServer.on("/jquery.simple.websocket.min.js", HTTP_GET,
               std::bind(&ESP32CSWebServer::streamResource, this, std::placeholders::_1));
  webServer.on("/jqClock-lite.min.js", HTTP_GET,
               std::bind(&ESP32CSWebServer::streamResource, this, std::placeholders::_1));
  webServer.on("/images/ajax-loader.gif", HTTP_GET,
               std::bind(&ESP32CSWebServer::streamResource, this, std::placeholders::_1));
  webServer.on("/features", HTTP_GET,
               std::bind(&ESP32CSWebServer::handleFeatures, this, std::placeholders::_1));
  webServer.on("/programmer", HTTP_GET | HTTP_POST,
               std::bind(&ESP32CSWebServer::handleProgrammer, this, std::placeholders::_1));
  webServer.on("/power", HTTP_GET | HTTP_PUT,
               std::bind(&ESP32CSWebServer::handlePower, this, std::placeholders::_1));
  webServer.on("/outputs", HTTP_GET | HTTP_POST | HTTP_PUT | HTTP_DELETE,
               std::bind(&ESP32CSWebServer::handleOutputs, this, std::placeholders::_1));
  webServer.on("/turnouts", HTTP_GET | HTTP_POST | HTTP_PUT | HTTP_DELETE,
               std::bind(&ESP32CSWebServer::handleTurnouts, this, std::placeholders::_1));
  webServer.on("/sensors", HTTP_GET | HTTP_POST | HTTP_DELETE,
               std::bind(&ESP32CSWebServer::handleSensors, this, std::placeholders::_1));
#if S88_ENABLED
  webServer.on("/s88sensors", HTTP_GET | HTTP_POST | HTTP_DELETE,
               std::bind(&ESP32CSWebServer::handleS88Sensors, this, std::placeholders::_1));
#endif
  webServer.on("/remoteSensors", HTTP_GET | HTTP_POST | HTTP_DELETE,
               std::bind(&ESP32CSWebServer::handleRemoteSensors, this, std::placeholders::_1));
  webServer.on("/config", HTTP_GET | HTTP_POST | HTTP_DELETE,
               std::bind(&ESP32CSWebServer::handleConfig, this, std::placeholders::_1));
  webServer.on("/locomotive", HTTP_GET | HTTP_POST | HTTP_PUT | HTTP_DELETE,
               std::bind(&ESP32CSWebServer::handleLocomotive, this, std::placeholders::_1));
  webServer.on("/update", HTTP_POST,
               std::bind(&ESP32CSWebServer::handleOTA, this, std::placeholders::_1),
               &handleOTAUpload);
  webServer.on("/index.html", HTTP_GET,
               std::bind(&ESP32CSWebServer::streamResource, this, std::placeholders::_1));
  webServer.rewrite("/", "/index.html");
  webServer.onNotFound(std::bind(&ESP32CSWebServer::notFoundHandler, this, std::placeholders::_1));

  webSocket.onEvent(handleWsEvent);
  webServer.addHandler(&webSocket);
  webServer.begin();
  mdns_->publish("websvr", "_http._tcp", 80);
}

void ESP32CSWebServer::broadcastToWS(const std::string &buf) {
  webSocket.textAll(buf.c_str());
}

void ESP32CSWebServer::handleProgrammer(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse();
  if(!MotorBoardManager::getBoardByName(MOTORBOARD_NAME_PROG)->isOn()) {
    MotorBoardManager::powerOn(MOTORBOARD_NAME_PROG);
  }
  // new programmer request
  if (request->method() == HTTP_GET) {
    if (request->arg(JSON_PROG_ON_MAIN).equalsIgnoreCase(JSON_VALUE_TRUE)) {
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    } else if(request->hasArg(JSON_IDENTIFY_NODE)) {
      JsonObject node = jsonResponse->getRoot();
      if(enterProgrammingMode()) {
        int16_t decoderConfig = readCV(CV_NAMES::DECODER_CONFIG);
        uint16_t decoderAddress = 0;
        if(decoderConfig > 0) {
          if(bitRead(decoderConfig, DECODER_CONFIG_BITS::DECODER_TYPE)) {
            uint8_t decoderManufacturer = readCV(CV_NAMES::DECODER_MANUFACTURER);
            int16_t addrMSB = readCV(CV_NAMES::ACCESSORY_DECODER_MSB_ADDRESS);
            int16_t addrLSB = readCV(CV_NAMES::SHORT_ADDRESS);
            if(addrMSB >= 0 && addrLSB >= 0) {
              if(decoderManufacturer == 0xA5) { // MERG uses 7 bit LSB
                decoderAddress = (uint16_t)(((addrMSB & 0x07) << 7) | (addrLSB & 0x7F));
              } else if(decoderManufacturer == 0x19) { // Team Digital uses 8 bit LSB and 4 bit MSB
                decoderAddress = (uint16_t)(((addrMSB & 0x0F) << 8) | addrLSB);
              } else { // NMRA spec shows 6 bit LSB
                decoderAddress = (uint16_t)(((addrMSB & 0x07) << 6) | (addrLSB & 0x1F));
              }
              node[JSON_ADDRESS_MODE_NODE] = JSON_VALUE_LONG_ADDRESS;
            } else {
              LOG(WARNING, "Failed to read address MSB/LSB");
              jsonResponse->setCode(STATUS_SERVER_ERROR);
            }
          } else {
            if(bitRead(decoderConfig, DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS)) {
              int16_t addrMSB = readCV(CV_NAMES::LONG_ADDRESS_MSB_ADDRESS);
              int16_t addrLSB = readCV(CV_NAMES::LONG_ADDRESS_LSB_ADDRESS);
              if(addrMSB >= 0 && addrLSB >= 0) {
                decoderAddress = (uint16_t)(((addrMSB & 0xFF) << 8) | (addrLSB & 0xFF));
                node[JSON_ADDRESS_MODE_NODE] = JSON_VALUE_LONG_ADDRESS;
              } else {
                LOG(WARNING, "Unable to read address MSB/LSB");
                jsonResponse->setCode(STATUS_SERVER_ERROR);
              }
            } else {
              int16_t shortAddr = readCV(CV_NAMES::SHORT_ADDRESS);
              if(shortAddr > 0) {
                decoderAddress = shortAddr;
                node[JSON_ADDRESS_MODE_NODE] = JSON_VALUE_SHORT_ADDRESS;
              } else {
                LOG(WARNING, "Unable to read short address CV");
                jsonResponse->setCode(STATUS_SERVER_ERROR);
              }
            }
            if(bitRead(decoderConfig, DECODER_CONFIG_BITS::SPEED_TABLE)) {
              node[JSON_SPEED_TABLE_NODE] = JSON_VALUE_ON;
            } else {
              node[JSON_SPEED_TABLE_NODE] = JSON_VALUE_OFF;
            }
          }
          if(decoderAddress > 0) {
            node[JSON_ADDRESS_NODE] = decoderAddress;
            auto roster = LocomotiveManager::getRosterEntry(decoderAddress, false);
            if(roster) {
              node[JSON_LOCO_NODE] = roster;
            } else if(request->hasArg(JSON_CREATE_NODE) && request->arg(JSON_CREATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE)) {
              roster = LocomotiveManager::getRosterEntry(decoderAddress);
              if(decoderConfig > 0) {
                if(bitRead(decoderConfig, DECODER_CONFIG_BITS::DECODER_TYPE)) {
                  roster->setType(JSON_VALUE_STATIONARY_DECODER);
                } else {
                  roster->setType(JSON_VALUE_MOBILE_DECODER);
                }
              }
              node[JSON_LOCO_NODE] = roster;
            }
          } else {
            LOG(WARNING, "Failed to read decoder address");
            jsonResponse->setCode(STATUS_SERVER_ERROR);
          }
        } else {
          LOG(WARNING, "Failed to read decoder configuration");
          jsonResponse->setCode(STATUS_SERVER_ERROR);
        }
        leaveProgrammingMode();
      } else {
        LOG(WARNING, "Programmer already in use");
        jsonResponse->setCode(STATUS_SERVER_ERROR);
      }
    } else {
      uint16_t cvNumber = request->arg(JSON_CV_NODE).toInt();
      if(enterProgrammingMode()) {
        int16_t cvValue = readCV(cvNumber);
        JsonObject node = jsonResponse->getRoot();
        node[JSON_CV_NODE] = cvNumber;
        node[JSON_VALUE_NODE] = cvValue;
        if(cvValue < 0) {
          jsonResponse->setCode(STATUS_SERVER_ERROR);
        } else {
          jsonResponse->setCode(STATUS_OK);
        }
        leaveProgrammingMode();
      } else {
        LOG(WARNING, "Programmer already in use");
        jsonResponse->setCode(STATUS_SERVER_ERROR);
      }
    }
  } else if(request->method() == HTTP_POST && request->hasArg(JSON_PROG_ON_MAIN)) {
    if (request->arg(JSON_PROG_ON_MAIN).equalsIgnoreCase(JSON_VALUE_TRUE)) {
      if(request->hasArg(JSON_CV_BIT_NODE)) {
        writeOpsCVBit(request->arg(JSON_ADDRESS_NODE).toInt(), request->arg(JSON_CV_NODE).toInt(),
          request->arg(JSON_CV_BIT_NODE).toInt(), request->arg(JSON_VALUE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
      } else {
        writeOpsCVByte(request->arg(JSON_ADDRESS_NODE).toInt(), request->arg(JSON_CV_NODE).toInt(),
          request->arg(JSON_VALUE_NODE).toInt());
      }
      jsonResponse->setCode(STATUS_OK);
    } else {
      bool writeSuccess = false;
      if(enterProgrammingMode()) {
        if(request->hasArg(JSON_CV_BIT_NODE)) {
          writeSuccess = writeProgCVBit(request->arg(JSON_CV_NODE).toInt(), request->arg(JSON_CV_BIT_NODE).toInt(),
            request->arg(JSON_VALUE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
        } else {
          writeSuccess = writeProgCVByte(request->arg(JSON_CV_NODE).toInt(), request->arg(JSON_VALUE_NODE).toInt());
        }
        leaveProgrammingMode();
      }
      if(writeSuccess) {
        jsonResponse->setCode(STATUS_OK);
      } else {
        jsonResponse->setCode(STATUS_SERVER_ERROR);
      }
    }
  } else {
    jsonResponse->setCode(STATUS_BAD_REQUEST);
  }
  LOG(VERBOSE, "Setting response size");
  jsonResponse->setLength();
  LOG(VERBOSE, "Sending response, %d bytes", jsonResponse->getSize());
  request->send(jsonResponse);
  LOG(VERBOSE, "sent");
 }

void ESP32CSWebServer::handlePower(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse(true);
  if(request->method() == HTTP_GET) {
    if(request->params()) {
      jsonResponse->getRoot().createNestedObject()[JSON_STATE_NODE] = MotorBoardManager::isTrackPowerOn() ? JSON_VALUE_TRUE : JSON_VALUE_FALSE;
    } else {
      JsonArray array = jsonResponse->getRoot();
      MotorBoardManager::getState(array);
    }
  } else if (request->method() == HTTP_PUT) {
    if(request->hasArg(JSON_OVERALL_STATE_NODE)) {
      if(request->arg(JSON_OVERALL_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE)) {
        MotorBoardManager::powerOnAll();
      } else {
        MotorBoardManager::powerOffAll();
      }
    } else if(request->hasArg(JSON_NAME_NODE)) {
      if(request->arg(JSON_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE)) {
        MotorBoardManager::powerOn(request->arg(JSON_NAME_NODE).c_str());
      } else {
        MotorBoardManager::powerOff(request->arg(JSON_NAME_NODE).c_str());
      }
    } else {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
 }

